{
    "architectures": [
        "SiglipVisionModel"
    ],
    "hidden_size": 1152,
    "image_size": 448,
    "intermediate_size": 4304,
    "model_type": "siglip_vision_model",
    "num_attention_heads": 16,
    "num_hidden_layers": 26,
    "patch_size": 14
}